C#/Research/forex-arbitrage/forex-arbitrage/Forex.GetConfigurationSettings.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <Authenticator xmlns="www.GainCapital.com.WebServices">
      <ApplicationName>NA</ApplicationName>
      <IPAddress>127.0.0.1</IPAddress>
      <MachineName>NA</MachineName>
      <Language>English</Language>
    </Authenticator>
  </soap:Header>
  <soap:Body>
    <GetConfigurationSettings xmlns="www.GainCapital.com.WebServices">
      <Token>string</Token>
    </GetConfigurationSettings>
  </soap:Body>
</soap:Envelope>